[
    "The only thing that goes erect when I'm near you is my middle finger.",
    "Looks like you fell off the ugly tree and hit every branch on the way down.",
    "You are proof that God has a sense of humor.",
    "I thought of you today. It reminded me to take the garbage out.",
    "Ordinarily people live and learn. You just live.",
    "You have something on your chin...3rd one down.",
    "Want someone prettier than you? Look up the town dump on the internet.",
    "Which sexual position produces the ugliest children? Ask your mother.",
    "You're like meat at a butcher shop. You could use a good hanging.",
    "I'm jealous of all the people that haven't met you.",
    "Antarctica is hotter than you.",
    "We all sprang from apes, but you didn't spring far enough.",
    "God made you as an example of what not to do.",
    "If ignorance is bliss, you must be the happiest person on earth.",
    "You're so ugly, when your mom dropped you off at school she got a fine for littering.",
    "You look like a model.. for depression.",
    "Scientists say the universe is made up of neutrons, protons and electrons. They forgot to mention morons.",
    "I could eat a bowl of alphabet soup and crap out a smarter comeback than what you just said.",
    "I hear when you were a child your mother wanted to hire somebody to take care of you, but the mafia wanted too much.",
    "Shut up, you'll never be the man your mother is.",
    "You're like STDs, nobody wants you, everyone hates you and it proves your parents should have used protection.",
    "Whats the difference between breathing in paint and talking to you? Breathing in paint kills less brain cells.",
    "You're so ugly, you had tinted windows on your incubator.",
    "Your parents hated you so much your bath toys were an iron and a toaster.",
    "Two wrongs don't make a right, take your parents as an example.",
    "You are proof that evolution can go in reverse.",
    "What are you doing here? Did someone leave your cage open?",
    "You're so ugly, the only dates you get are on a calendar.",
    "Why don't you slip into something more comfortable? Like a coma.",
    "You're so fat you need cheat codes to play Wii Fit.",
    "It's better to let someone think you are an Idiot than to open your mouth and prove it.",
    "Your bacteria is the only culture you have.",
    "When you get fired from McDonald's you can rent out that forehead as ad space.",
    "If laughter is the best medicine, your face must be curing the world.",
    "You're the reason the gene pool needs a lifeguard.",
    "If you were twice as smart, you'd still be retarded.",
    "Is your ass jealous of the amount of shit that just came out of your mouth?",
    "I can prove that God isn't real. If He was real, He would never have made something as ugly as you.",
    "I'm not saying I hate you, but I would unplug your life support to charge my phone.",
    "The only positive thing about you is your HIV status.",
    "All the branches fell off your family tree when you were born.",
    "You are the best argument for post-term abortion.",
    "You look like what happens when you press the random character button on the creation menu.",
    "Out of 100,000 sperm, you were the fastest?",
    "I would ask how old you are, but I know you can't count that high.",
    "It's kinda sad watching you attempt to fit your entire vocabulary into a sentence.",
    "You're so ugly, when you got robbed, the robbers made you wear their masks.",
    "If you spoke your mind, you'd be speechless.",
    "The last time I saw a face like yours I fed it a banana.",
    "You're so ugly, when you popped out; the doctor said aww what a treasure and your mom said yeah lets bury it.",
    "Has your face always looked like that? Or did you just get surgery to make it look worse then trash?",
    "I'll never forget the first time we met, although I'll keep trying.",
    "Everyone has the right to be stupid, but you're just abusing the privilege.",
    "You look like the middle picture of one of those meth addiction progression graphics.",
    "It looks like your face caught on fire and someone tried to put it out with a hammer.",
    "It looks like your face caught on fire and someone tried to put it out with a fork.",
    "I heard you took an IQ test and they said your results were negative.",
    "Do you realize that people just tolerate you?",
    "I treasure the time I don't spend with you.",
    "So, a thought crossed your mind? Must have been a long and lonely journey.",
    "When you get an idea, a light bulb doesn't appear over your head. Instead, a pile of shit does.",
    "I tried to see things from your perspective, but I couldn't seem to shove my head that far up my ass.",
    "You must have been born on a highway because that's where most accidents happen.",
    "Oh my God, look at you. Was anyone else hurt in the accident?"
]
